# Taps
tap "koekeishiya/formulae"      # yabai, skhd
tap "supabase/tap"              # supabase CLI

# ------------------------------------------------------------------
# CLI tools
# ------------------------------------------------------------------
brew "automake"
brew "awsume"
brew "bat"
brew "bottom"
brew "btop"
brew "carapace"
brew "cloc"
brew "cloudflared"
brew "cpanminus"            # perlPackages.Appcpanminus in nix
brew "curl"
brew "docker"
brew "exercism"
brew "fastfetch"
brew "fontconfig"
brew "fd"
brew "fish"
brew "fnm"
brew "fzf"
brew "gdu"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-sed"              # gnused in nix
brew "go"
brew "hub"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "make"                 # gnumake in nix
brew "ncurses"
brew "pandoc"
brew "pgcli"
brew "php"
brew "pipx"
brew "pkgconf"
brew "pngpaste"
brew "poppler"              # poppler-utils in nix
brew "python@3"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "sesh"
brew "starship"
brew "supabase/tap/supabase"
brew "tectonic"
brew "terraform"
brew "tmux"
brew "tree"
brew "unar"
brew "uv"
brew "webp"
brew "wget"
brew "wimlib"
brew "yazi"
brew "yq"
brew "zoxide"

# ------------------------------------------------------------------
# macOS-specific CLI
# ------------------------------------------------------------------
brew "colima"
brew "mas"
brew "bob"
brew "pam-reattach"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# ------------------------------------------------------------------
# Casks (GUI applications)
# ------------------------------------------------------------------
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "betterdisplay"
cask "chatgpt"
cask "cyberduck"
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "istat-menus"
cask "karabiner-elements"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "postman"
cask "raindropio"
cask "raycast"
cask "redis-insight"
cask "slack"
cask "spacelauncher"
cask "spotify"
cask "tableplus"

# Fonts
cask "font-cascadia-code-nf"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"

