alefragnani.project-manager
anthropic.claude-code
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
coderabbit.coderabbit-vscode
cunbidun.flash-vscode
dbaeumer.vscode-eslint
dcasella.monokai-plusplus
docker.docker
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
fabiospampinato.vscode-monokai-night
formulahendry.auto-rename-tag
github.vscode-github-actions
gruntfuggly.todo-tree
haphazarddev.oil-code
humao.rest-client
jdinhlife.gruvbox
jnoortheen.nix-ide
lamarcke.kanagawa-black
liviuschera.noctis
maosantaella.night-wolf
mathcale.theme-dracula-refined
mikestead.dotenv
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
mvllow.rose-pine
prisma.prisma
quicktype.quicktype
redhat.vscode-yaml
ritwickdey.liveserver
ryuta46.multi-command
shd101wyy.markdown-preview-enhanced
sleistner.vscode-fileutils
tamasfe.even-better-toml
usernamehw.errorlens
vscode-icons-team.vscode-icons
vscodevim.vim
vue.volar
william-voyek.vscode-nginx
xabikos.javascriptsnippets
yasendimitrov.lazygit-vscode-v2
yzhang.markdown-all-in-one
